go_collection_types.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: Go
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: Go: Collection types

* Arrays
  The type *[n]T* is an array of *n* values of type *T*. An array's length is part of its type, so array cannot be resized.
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    func main() {
            var a1[10]int;
            fmt.Printf("1. %q\n", a1)
            //
            var a2 [2]string
            a2[0] = "Hello"
            a2[1] = "World"
            fmt.Println("2.", a2[0], a2[1])
            fmt.Println("3.", a2)
            // set the array entries as you declare the array
            a3  := [2]string{"hello", "world!"}
            fmt.Printf("4. %q\n", a3)
            // use an ellipsis to use an implicit length when you pass the values
            a4 := [...]string{"hello", "world!"}
            fmt.Printf("5. %q\n", a4)
    }
  #+END_SRC

  #+RESULTS:
  : 1. ['\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00']
  : 2. Hello World
  : 3. [Hello World]
  : 4. ["hello" "world!"]
  : 5. ["hello" "world!"]

** Printing arrays
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             a := [2]string{"hello", "world!"}
             fmt.Println(a)
             // [hello world!]
             fmt.Printf("%s\n", a)
             // [hello world!]
             fmt.Printf("%q\n", a)*
             // ["hello" "world!"]
     }
   #+END_SRC

   #+RESULTS:
   : [hello world!]
   : [hello world!]
   : ["hello" "world!"]

** Multi-dimensional arrays
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             var a [2][3]string
             for i := 0; i < 2; i++ {
                     for j := 0; j < 3; j++ {
                             a[i][j] = fmt.Sprintf("row %d - column %d", i+1, j+1)
                     }
             }
             fmt.Printf("%q", a)
     }

   #+END_SRC

   #+RESULTS:
   : [["row 1 - column 1" "row 1 - column 2" "row 1 - column 3"] ["row 2 - column 1" "row 2 - column 2" "row 2 - column 3"]]

* Slices
  Slices hold references to an underlying array, and if you assign one slice to another, *both refer to the same array*. If a function takes a slice argument, changes it makes to the elements of the slice will be visible to the caller, analogous to passing *a pointer to the underlying array*. A slice points to an array of values and also includes a length. Slices can be resized since they are just a wrapper on top of another data structure.
  *[]T* is a slice with elements of type *T*
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    func main() {
            p := []int{2, 3, 5, 7, 11, 13}
            fmt.Println(p)
    }
  #+END_SRC

  #+RESULTS:
  : [2 3 5 7 11 13]

** Slicing a slice
   Slices can be re-sliced, creating a new slice value that *points to the same array*. Thus, *s[lo:hi]* evaluates to a slice of the elements from lo through hi-1, inclusive. *s[lo:lo]* evaluates empty slice. *s[lo:lo+1]* has one element.
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             mySlice := []int{2, 3, 5, 7, 11, 13}
             fmt.Println(mySlice)

             fmt.Println(mySlice[1:4])

             // missing low index implies 0
             fmt.Println(mySlice[:3])

             // missing high index implies len(s)
             fmt.Println(mySlice[4:])
     }
   #+END_SRC

   #+RESULTS:
   : [2 3 5 7 11 13]
   : [3 5 7]
   : [2 3 5]
   : [11 13]

