go_collection_types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-26 Thu 20:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Collection types</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Collection types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org38d2084">1. Arrays</a>
<ul>
<li><a href="#orga7a1578">1.1. Printing arrays</a></li>
<li><a href="#org68fda09">1.2. Multi-dimensional arrays</a></li>
</ul>
</li>
<li><a href="#org434b772">2. Slices</a>
<ul>
<li><a href="#org817806f">2.1. Slicing a slice</a></li>
<li><a href="#org56d8a31">2.2. Making slices</a></li>
<li><a href="#orgacf971a">2.3. Appending to a slice</a></li>
<li><a href="#org1052be9">2.4. Length</a></li>
<li><a href="#orgebeaf7e">2.5. Nil slices</a></li>
<li><a href="#org4a0d20b">2.6. Copy</a></li>
<li><a href="#orgbb7050e">2.7. Cut</a></li>
<li><a href="#org8fa86ec">2.8. Delete</a></li>
<li><a href="#orgaf27c16">2.9. Delete without preserving order</a></li>
<li><a href="#orge88303b">2.10. Cut</a></li>
<li><a href="#orgd10a414">2.11. Delete</a></li>
<li><a href="#org5740dc3">2.12. Delete without preserving order</a></li>
<li><a href="#orge695958">2.13. Expand</a></li>
<li><a href="#org0b4f7b2">2.14. Extend</a></li>
<li><a href="#orgb6f436f">2.15. Pop</a></li>
<li><a href="#org8bb8961">2.16. Pop Back</a></li>
<li><a href="#org578ee4c">2.17. Push</a></li>
<li><a href="#org6af3430">2.18. Push Front</a></li>
<li><a href="#org19bb88a">2.19. Shift</a></li>
<li><a href="#org2ae62bb">2.20. Reversing</a></li>
</ul>
</li>
<li><a href="#org90b4cbe">3. Range</a>
<ul>
<li><a href="#org910b0ce">3.1. Break &amp; continue</a></li>
</ul>
</li>
<li><a href="#orgf2918e0">4. Maps</a>
<ul>
<li><a href="#orgc5890b5">4.1. Insert an element</a></li>
<li><a href="#org343e6cf">4.2. Delete an element</a></li>
<li><a href="#org1b3437a">4.3. Retrieve an element</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org38d2084" class="outline-2">
<h2 id="org38d2084"><span class="section-number-2">1</span> Arrays</h2>
<div class="outline-text-2" id="text-1">
<p>
The type <b>[n]T</b> is an array of <b>n</b> values of type <b>T</b>. An array's length is part of its type, so array cannot be resized.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #00ff00; font-weight: bold;">var</span> a1[10]int;
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"1. %q\n"</span>, a1)
        <span style="color: #5F7F5F;">//</span>
        <span style="color: #00ff00; font-weight: bold;">var</span> a2 [2]<span style="color: #00ffff;">string</span>
        a2[0] = <span style="color: #ffa500;">"Hello"</span>
        a2[1] = <span style="color: #ffa500;">"World"</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"2."</span>, a2[0], a2[1])
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"3."</span>, a2)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">set the array entries as you declare the array</span>
        a3  := [2]<span style="color: #00ffff;">string</span>{<span style="color: #ffa500;">"hello"</span>, <span style="color: #ffa500;">"world!"</span>}
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"4. %q\n"</span>, a3)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">use an ellipsis to use an implicit length when you pass the values</span>
        a4 := [...]<span style="color: #00ffff;">string</span>{<span style="color: #ffa500;">"hello"</span>, <span style="color: #ffa500;">"world!"</span>}
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"5. %q\n"</span>, a4)
}
</pre>
</div>

<pre class="example">
1. ['\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00' '\x00']
2. Hello World
3. [Hello World]
4. ["hello" "world!"]
5. ["hello" "world!"]

</pre>
</div>

<div id="outline-container-orga7a1578" class="outline-3">
<h3 id="orga7a1578"><span class="section-number-3">1.1</span> Printing arrays</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        a := [2]<span style="color: #00ffff;">string</span>{<span style="color: #ffa500;">"hello"</span>, <span style="color: #ffa500;">"world!"</span>}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(a)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">[hello world!]</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s\n"</span>, a)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">[hello world!]</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%q\n"</span>, a)*
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">["hello" "world!"]</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org68fda09" class="outline-3">
<h3 id="org68fda09"><span class="section-number-3">1.2</span> Multi-dimensional arrays</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #00ff00; font-weight: bold;">var</span> a [2][3]<span style="color: #00ffff;">string</span>
        <span style="color: #00ff00; font-weight: bold;">for</span> i := 0; i &lt; 2; i++ {
                <span style="color: #00ff00; font-weight: bold;">for</span> j := 0; j &lt; 3; j++ {
                        a[i][j] = fmt.<span style="color: #00ffff; font-weight: bold;">Sprintf</span>(<span style="color: #ffa500;">"row %d - column %d"</span>, i+1, j+1)
                }
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%q"</span>, a)
}

</pre>
</div>

<pre class="example">
[["row 1 - column 1" "row 1 - column 2" "row 1 - column 3"] ["row 2 - column 1" "row 2 - column 2" "row 2 - column 3"]]

</pre>
</div>
</div>
</div>

<div id="outline-container-org434b772" class="outline-2">
<h2 id="org434b772"><span class="section-number-2">2</span> Slices</h2>
<div class="outline-text-2" id="text-2">
<p>
Slices hold references to an underlying array, and if you assign one slice to another, <b>both refer to the same array</b>. If a function takes a slice argument, changes it makes to the elements of the slice will be visible to the caller, analogous to passing <b>a pointer to the underlying array</b>. A slice points to an array of values and also includes a length. Slices can be resized since they are just a wrapper on top of another data structure.
<b>[]T</b> is a slice with elements of type <b>T</b>
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        p := []<span style="color: #00ffff;">int</span>{2, 3, 5, 7, 11, 13}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(p)
}
</pre>
</div>

<pre class="example">
[2 3 5 7 11 13]

</pre>
</div>

<div id="outline-container-org817806f" class="outline-3">
<h3 id="org817806f"><span class="section-number-3">2.1</span> Slicing a slice</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Slices can be re-sliced, creating a new slice value that <b>points to the same array</b>. Thus, <b>s[lo:hi]</b> evaluates to a slice of the elements from lo through hi-1, inclusive. <b>s[lo:lo]</b> evaluates empty slice. <b>s[lo:lo+1]</b> has one element.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        mySlice := []<span style="color: #00ffff;">int</span>{2, 3, 5, 7, 11, 13}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(mySlice)

        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(mySlice[1:4])

        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">missing low index implies 0</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(mySlice[:3])

        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">missing high index implies len(s)</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(mySlice[4:])
}
</pre>
</div>

<pre class="example">
[2 3 5 7 11 13]
[3 5 7]
[2 3 5]
[11 13]

</pre>
</div>
</div>
