go_collection_types.org
** Making slices
   Besides creating slices by passing the values right away (slice literal), you can also use make. It works by allocating a zeroed array and returning a slice that refers to that array.
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             cities := make([]string, 3)
             cities[0] = "Santa Monica"
             cities[1] = "Venice"
             cities[2] = "Los Angeles"
             fmt.Printf("%q", cities)
     }
   #+END_SRC

   #+RESULTS:
   : ["Santa Monica" "Venice" "Los Angeles"]
   When you make multi-dimensional slice, it will make slice with N empty slices
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             a := make([]int, 5)
             printSlice("a", a)

             b := make([]int, 0, 5)
             printSlice("b", b)

             c := b[:2]
             printSlice("c", c)

             d := c[2:5]
             printSlice("d", d)

             e := make([][]int, 12)
             fmt.Println("multi-dimensional slice e: ", e)
             printSlice("e[0]", e[0])
     }

     func printSlice(s string, x []int) {
             fmt.Printf("%s len=%d cap=%d %v\n",
                     s, len(x), cap(x), x)
     }
   #+END_SRC

   #+RESULTS:
   : a len=5 cap=5 [0 0 0 0 0]
   : b len=0 cap=5 []
   : c len=2 cap=5 [0 0]
   : d len=3 cap=3 [0 0 0]
   : multi-dimensional slice e:  [[] [] [] [] [] [] [] [] [] [] [] []]
   : e[0] len=0 cap=0 []

** Appending to a slice
   You would get a runtime error if you were to do that
   #+BEGIN_SRC go :results none :exports code
     cities := []string{}
     cities[0] = "Santa Monica"
   #+END_SRC
   There is a way to do that though, and that is by using the append function:
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             cities := []string{}
             cities = append(cities, "San Diego")
             fmt.Println(cities)
             // You can append more than one entry to a slice
             cities = []string{}
             cities = append(cities, "San Diego", "Mountain View")
             fmt.Printf("%q", cities)
             // You can also append a slice to another using an ellipsis
             otherCities := []string{"Santa Monica", "Venice"}
             cities = append(cities, otherCities...)
             fmt.Printf("%q", cities)
     }
   #+END_SRC

   #+RESULTS:
   : [San Diego]
   : ["San Diego" "Mountain View"]["San Diego" "Mountain View" "Santa Monica" "Venice"]
#+BEGIN_CENTER
ELLIPSIS IS A BUILT-IN FEATURE OF THE LANGUAGE THAT MEANS THAT THE ELEMENT IS A COLLECTION.
#+END_CENTER

** Length
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             cities := []string{
                     "Santa Monica",
                     "San Diego",
                     "San Francisco",
             }
             fmt.Println(len(cities))
             countries := make([]string, 42)
             fmt.Println(len(countries))
     }
   #+END_SRC

   #+RESULTS:
   : 3
   : 42

** Nil slices
   The zero value of a slice is *nil*. A *nil* slice has a length and capacity of *0*.
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             var z []int
             fmt.Println(z, len(z), cap(z))

             if z == nil {
                     fmt.Println("nil!")
             }
     }
   #+END_SRC

   #+RESULTS:
   : [] 0 0
   : nil!

** Copy
   #+BEGIN_SRC go :results none :exports code
     b = make([]T, len(a))
     copy(b, a)
     // or
     b = append([]T(nil), a...)
   #+END_SRC

** Cut
   #+BEGIN_SRC go :results none :exports code
     a = append(a[:i], a[j:]...)
   #+END_SRC

** Delete
   #+BEGIN_SRC go :results none :exports code
     a = append(a[:i], a[i+1:]...)
     // or
     a = a[:i+copy(a[i:], a[i+1:])]
   #+END_SRC

