go_collection_types.html

<div id="outline-container-org56d8a31" class="outline-3">
<h3 id="org56d8a31"><span class="section-number-3">2.2</span> Making slices</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Besides creating slices by passing the values right away (slice literal), you can also use make. It works by allocating a zeroed array and returning a slice that refers to that array.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">string</span>, 3)
        cities[0] = <span style="color: #ffa500;">"Santa Monica"</span>
        cities[1] = <span style="color: #ffa500;">"Venice"</span>
        cities[2] = <span style="color: #ffa500;">"Los Angeles"</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%q"</span>, cities)
}
</pre>
</div>

<pre class="example">
["Santa Monica" "Venice" "Los Angeles"]

</pre>
<p>
When you make multi-dimensional slice, it will make slice with N empty slices
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        a := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">int</span>, 5)
        <span style="color: #00ffff; font-weight: bold;">printSlice</span>(<span style="color: #ffa500;">"a"</span>, a)

        b := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">int</span>, 0, 5)
        <span style="color: #00ffff; font-weight: bold;">printSlice</span>(<span style="color: #ffa500;">"b"</span>, b)

        c := b[:2]
        <span style="color: #00ffff; font-weight: bold;">printSlice</span>(<span style="color: #ffa500;">"c"</span>, c)

        d := c[2:5]
        <span style="color: #00ffff; font-weight: bold;">printSlice</span>(<span style="color: #ffa500;">"d"</span>, d)

        e := <span style="color: #b0c4de; font-weight: bold;">make</span>([][]<span style="color: #00ffff;">int</span>, 12)
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"multi-dimensional slice e: "</span>, e)
        <span style="color: #00ffff; font-weight: bold;">printSlice</span>(<span style="color: #ffa500;">"e[0]"</span>, e[0])
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">printSlice</span>(s <span style="color: #00ffff;">string</span>, x []<span style="color: #00ffff;">int</span>) {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s len=%d cap=%d %v\n"</span>,
                s, <span style="color: #b0c4de; font-weight: bold;">len</span>(x), <span style="color: #b0c4de; font-weight: bold;">cap</span>(x), x)
}
</pre>
</div>

<pre class="example">
a len=5 cap=5 [0 0 0 0 0]
b len=0 cap=5 []
c len=2 cap=5 [0 0]
d len=3 cap=3 [0 0 0]
multi-dimensional slice e:  [[] [] [] [] [] [] [] [] [] [] [] []]
e[0] len=0 cap=0 []

</pre>
</div>
</div>

<div id="outline-container-orgacf971a" class="outline-3">
<h3 id="orgacf971a"><span class="section-number-3">2.3</span> Appending to a slice</h3>
<div class="outline-text-3" id="text-2-3">
<p>
You would get a runtime error if you were to do that
</p>
<div class="org-src-container">
<pre class="src src-go">cities := []<span style="color: #00ffff;">string</span>{}
cities[0] = <span style="color: #ffa500;">"Santa Monica"</span>
</pre>
</div>
<p>
There is a way to do that though, and that is by using the append function:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := []<span style="color: #00ffff;">string</span>{}
        cities = <span style="color: #b0c4de; font-weight: bold;">append</span>(cities, <span style="color: #ffa500;">"San Diego"</span>)
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(cities)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">You can append more than one entry to a slice</span>
        cities = []<span style="color: #00ffff;">string</span>{}
        cities = <span style="color: #b0c4de; font-weight: bold;">append</span>(cities, <span style="color: #ffa500;">"San Diego"</span>, <span style="color: #ffa500;">"Mountain View"</span>)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%q"</span>, cities)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">You can also append a slice to another using an ellipsis</span>
        otherCities := []<span style="color: #00ffff;">string</span>{<span style="color: #ffa500;">"Santa Monica"</span>, <span style="color: #ffa500;">"Venice"</span>}
        cities = <span style="color: #b0c4de; font-weight: bold;">append</span>(cities, otherCities...)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%q"</span>, cities)
}
</pre>
</div>

<pre class="example">
[San Diego]
["San Diego" "Mountain View"]["San Diego" "Mountain View" "Santa Monica" "Venice"]

</pre>
<div class="org-center">
<p>
ELLIPSIS IS A BUILT-IN FEATURE OF THE LANGUAGE THAT MEANS THAT THE ELEMENT IS A COLLECTION.
</p>
</div>
</div>
</div>

<div id="outline-container-org1052be9" class="outline-3">
<h3 id="org1052be9"><span class="section-number-3">2.4</span> Length</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := []<span style="color: #00ffff;">string</span>{
                <span style="color: #ffa500;">"Santa Monica"</span>,
                <span style="color: #ffa500;">"San Diego"</span>,
                <span style="color: #ffa500;">"San Francisco"</span>,
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #b0c4de; font-weight: bold;">len</span>(cities))
        countries := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">string</span>, 42)
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #b0c4de; font-weight: bold;">len</span>(countries))
}
</pre>
</div>

<pre class="example">
3
42

</pre>
</div>
</div>

<div id="outline-container-orgebeaf7e" class="outline-3">
<h3 id="orgebeaf7e"><span class="section-number-3">2.5</span> Nil slices</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The zero value of a slice is <b>nil</b>. A <b>nil</b> slice has a length and capacity of <b>0</b>.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #00ff00; font-weight: bold;">var</span> z []<span style="color: #00ffff;">int</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(z, <span style="color: #b0c4de; font-weight: bold;">len</span>(z), <span style="color: #b0c4de; font-weight: bold;">cap</span>(z))

        <span style="color: #00ff00; font-weight: bold;">if</span> z == <span style="color: #7fffd4;">nil</span> {
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"nil!"</span>)
        }
}
</pre>
</div>

<pre class="example">
[] 0 0
nil!

</pre>
</div>
</div>
