go_collection_types.org
** Delete without preserving order
   #+BEGIN_SRC go :results none :exports code
     a[i] = a[len(a)-1]
     a = a[:len(a)-1]
   #+END_SRC

  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    func main() {
            cities := []string{
                    "A",
                    "B",
                    "C",
                    "D",
                    "E",
            }
            fmt.Println(cities)
            cities[2] = cities[len(cities)-1]
            fmt.Println(cities)
            cities = cities[:len(cities)-1]
            fmt.Println(cities)
    }
  #+END_SRC

  #+RESULTS:
  : [A B C D E]
  : [A B E D E]
  : [A B E D]
  *NOTE* If the type of the element is a pointer or a struct with pointer fields, which need to be garbage collected, the above implementations of Cut and Delete have a potential memory leak problem: some elements with values are still referenced by slice a and thus can not be collected. The following code can fix this problem.

** Cut
  #+BEGIN_SRC go :results none :exports code
    copy(a[i:], a[j:])
    for k, n := len(a)-j+i, len(a); k < n; k++ {
            a[k] = nil // or the zero value of T
    }
    a = a[:len(a)-j+i]
  #+END_SRC

** Delete
   #+BEGIN_SRC go :results none :exports code
     copy(a[i:], a[i+1:])
     a[len(a)-1] = nil // or the zero value of T
     a = a[:len(a)-1]
   #+END_SRC
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             cities := []string{
                     "A",
                     "B",
                     "C",
                     "D",
                     "E",
             }
             i := 2
             fmt.Println("BEFORE: ", cities)
             copy(cities[i:], cities[i+1:])
             fmt.Println("AFTER COPY: ", cities)
             cities[len(cities)-1] = "" // or the zero value of T
             fmt.Println("AFTER ERASE: ", cities)
             cities = cities[:len(cities)-1]
             fmt.Println("AFTER RESIZE: ", cities)
     }
   #+END_SRC

   #+RESULTS:
   : BEFORE:  [A B C D E]
   : AFTER COPY:  [A B D E E]
   : AFTER ERASE:  [A B D E ]
   : AFTER RESIZE:  [A B D E]

** Delete without preserving order
   #+BEGIN_SRC go :results none :exports code
     a[i] = a[len(a)-1]
     a[len(a)-1] = nil
     a = a[:len(a)-1]
   #+END_SRC

** Expand
   #+BEGIN_SRC go :results output :exports code
     package main

     import "fmt"

     func main() {
             cities := []string{
                     "A",
                     "B",
                     "C",
                     "D",
                     "E",
             }
             i := 2
             j := 4
             cities = append(cities[:i], append(make([]string, j), cities[i:]...)...)
             fmt.Println(cities)
     }
   #+END_SRC

   #+RESULTS:
   : [A B     C D E]

** Extend
   #+BEGIN_SRC go :results none :exports code
     a = append(a, make([]T, j)...)
   #+END_SRC

** Pop
   #+BEGIN_SRC go :results none :exports code
     x, a = a[0], a[1:]
   #+END_SRC

** Pop Back
   #+BEGIN_SRC go :results none :exports code
     x, a = a[len(a)-1], a[:len(a)-1]
   #+END_SRC

** Push
   #+BEGIN_SRC go :results none :exports code
     a = append(a, x)
   #+END_SRC

** Push Front
   #+BEGIN_SRC go :results none :exports code
     a = append([]T{x}, a...)
   #+END_SRC

** Shift
   #+BEGIN_SRC go :results none :exports code
     x, a := a[0], a[1:]
   #+END_SRC

** Reversing
   #+BEGIN_SRC go :results none :exports code
     for i := len(a)/2-1; i >= 0; i-- {
             opp := len(a)-1-i
             a[i], a[opp] = a[opp], a[i]
     }
   #+END_SRC

