go_collection_types.html

<div id="outline-container-org4a0d20b" class="outline-3">
<h3 id="org4a0d20b"><span class="section-number-3">2.6</span> Copy</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-go">b = <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">T</span>, <span style="color: #b0c4de; font-weight: bold;">len</span>(a))
<span style="color: #b0c4de; font-weight: bold;">copy</span>(b, a)
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">or</span>
b = <span style="color: #b0c4de; font-weight: bold;">append</span>([]<span style="color: #00ffff; font-weight: bold;">T</span>(<span style="color: #7fffd4;">nil</span>), a...)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb7050e" class="outline-3">
<h3 id="orgbb7050e"><span class="section-number-3">2.7</span> Cut</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-go">a = <span style="color: #b0c4de; font-weight: bold;">append</span>(a[:i], a[j:]...)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fa86ec" class="outline-3">
<h3 id="org8fa86ec"><span class="section-number-3">2.8</span> Delete</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-go">a = <span style="color: #b0c4de; font-weight: bold;">append</span>(a[:i], a[i+1:]...)
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">or</span>
a = a[:i+<span style="color: #b0c4de; font-weight: bold;">copy</span>(a[i:], a[i+1:])]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf27c16" class="outline-3">
<h3 id="orgaf27c16"><span class="section-number-3">2.9</span> Delete without preserving order</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-go">a[i] = a[<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
a = a[:<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := []<span style="color: #00ffff;">string</span>{
                <span style="color: #ffa500;">"A"</span>,
                <span style="color: #ffa500;">"B"</span>,
                <span style="color: #ffa500;">"C"</span>,
                <span style="color: #ffa500;">"D"</span>,
                <span style="color: #ffa500;">"E"</span>,
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(cities)
        cities[2] = cities[<span style="color: #b0c4de; font-weight: bold;">len</span>(cities)-1]
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(cities)
        cities = cities[:<span style="color: #b0c4de; font-weight: bold;">len</span>(cities)-1]
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(cities)
}
</pre>
</div>

<pre class="example">
[A B C D E]
[A B E D E]
[A B E D]

</pre>
<p>
<b>NOTE</b> If the type of the element is a pointer or a struct with pointer fields, which need to be garbage collected, the above implementations of Cut and Delete have a potential memory leak problem: some elements with values are still referenced by slice a and thus can not be collected. The following code can fix this problem.
</p>
</div>
</div>

<div id="outline-container-orge88303b" class="outline-3">
<h3 id="orge88303b"><span class="section-number-3">2.10</span> Cut</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #b0c4de; font-weight: bold;">copy</span>(a[i:], a[j:])
<span style="color: #00ff00; font-weight: bold;">for</span> k, n := <span style="color: #b0c4de; font-weight: bold;">len</span>(a)-j+i, <span style="color: #b0c4de; font-weight: bold;">len</span>(a); k &lt; n; k++ {
        a[k] = <span style="color: #7fffd4;">nil</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">or the zero value of T</span>
}
a = a[:<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-j+i]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd10a414" class="outline-3">
<h3 id="orgd10a414"><span class="section-number-3">2.11</span> Delete</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #b0c4de; font-weight: bold;">copy</span>(a[i:], a[i+1:])
a[<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1] = <span style="color: #7fffd4;">nil</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">or the zero value of T</span>
a = a[:<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := []<span style="color: #00ffff;">string</span>{
                <span style="color: #ffa500;">"A"</span>,
                <span style="color: #ffa500;">"B"</span>,
                <span style="color: #ffa500;">"C"</span>,
                <span style="color: #ffa500;">"D"</span>,
                <span style="color: #ffa500;">"E"</span>,
        }
        i := 2
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"BEFORE: "</span>, cities)
        <span style="color: #b0c4de; font-weight: bold;">copy</span>(cities[i:], cities[i+1:])
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"AFTER COPY: "</span>, cities)
        cities[<span style="color: #b0c4de; font-weight: bold;">len</span>(cities)-1] = <span style="color: #ffa500;">""</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">or the zero value of T</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"AFTER ERASE: "</span>, cities)
        cities = cities[:<span style="color: #b0c4de; font-weight: bold;">len</span>(cities)-1]
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"AFTER RESIZE: "</span>, cities)
}
</pre>
</div>

<pre class="example">
BEFORE:  [A B C D E]
AFTER COPY:  [A B D E E]
AFTER ERASE:  [A B D E ]
AFTER RESIZE:  [A B D E]

</pre>
</div>
</div>

<div id="outline-container-org5740dc3" class="outline-3">
<h3 id="org5740dc3"><span class="section-number-3">2.12</span> Delete without preserving order</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-go">a[i] = a[<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
a[<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1] = <span style="color: #7fffd4;">nil</span>
a = a[:<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
</pre>
</div>
</div>
</div>

<div id="outline-container-orge695958" class="outline-3">
<h3 id="orge695958"><span class="section-number-3">2.13</span> Expand</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        cities := []<span style="color: #00ffff;">string</span>{
                <span style="color: #ffa500;">"A"</span>,
                <span style="color: #ffa500;">"B"</span>,
                <span style="color: #ffa500;">"C"</span>,
                <span style="color: #ffa500;">"D"</span>,
                <span style="color: #ffa500;">"E"</span>,
        }
        i := 2
        j := 4
        cities = <span style="color: #b0c4de; font-weight: bold;">append</span>(cities[:i], <span style="color: #b0c4de; font-weight: bold;">append</span>(<span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">string</span>, j), cities[i:]...)...)
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(cities)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b4f7b2" class="outline-3">
<h3 id="org0b4f7b2"><span class="section-number-3">2.14</span> Extend</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-go">a = <span style="color: #b0c4de; font-weight: bold;">append</span>(a, <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">T</span>, j)...)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6f436f" class="outline-3">
<h3 id="orgb6f436f"><span class="section-number-3">2.15</span> Pop</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre class="src src-go">x, a = a[0], a[1:]
</pre>
</div>
</div>
</div>

<div id="outline-container-org8bb8961" class="outline-3">
<h3 id="org8bb8961"><span class="section-number-3">2.16</span> Pop Back</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">
<pre class="src src-go">x, a = a[<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1], a[:<span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1]
</pre>
</div>
</div>
</div>
