go_collection_types.org
* Range
  The *range* form of the loop iterates over a *slice* or a *map*.
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    var pow = []int{1, 2, 4, 8, 16, 32, 64, 128}

    func main() {
            for i, v := range pow {
                    fmt.Printf("2**%d = %d\n", i, v)
            }
    }
  #+END_SRC

  #+RESULTS:
  : 2**0 = 1
  : 2**1 = 2
  : 2**2 = 4
  : 2**3 = 8
  : 2**4 = 16
  : 2**5 = 32
  : 2**6 = 64
  : 2**7 = 128
  You can skip /index/ or /value/ by assigning to _. If you only want the index, drop the ", value" entirely.
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    func main() {
            pow := make([]int, 10)
            for i := range pow {
                    pow[i] = 1 << uint(i)
            }
            for _, value := range pow {
                    fmt.Printf("%d\n", value)
            }
    }
  #+END_SRC

  #+RESULTS:
  #+begin_example
  1
  2
  4
  8
  16
  32
  64
  128
  256
  512
  #+end_example

** Break & continue
   #+BEGIN_SRC go :results output :exports both
     package main

     import "fmt"

     func main() {
             pow := make([]int, 10)
             for i := range pow {
                     pow[i] = 1 << uint(i)
                     if pow[i] >= 16 {
                             break
                     }
             }
             fmt.Println(pow)

             pow = make([]int, 10)
             for i := range pow {
                     if i%2 == 0 {
                             continue
                     }
                     pow[i] = 1 << uint(i)
             }
             fmt.Println(pow)
     }
   #+END_SRC

   #+RESULTS:
   : [1 2 4 8 16 0 0 0 0 0]
   : [0 2 0 8 0 32 0 128 0 512]

* Maps
  Maps are somewhat similar to what other languages call “dictionaries” or “hashes”. A map maps keys to values.
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    func main() {
            celebs := map[string]int{
                    "Nicolas Cage":       50,
                    "Selena Gomez":       21,
                    "Jude Law":           41,
                    "Scarlett Johansson": 29,
            }

            fmt.Printf("%#v", celebs)
    }
  #+END_SRC

  #+RESULTS:
  : map[string]int{"Selena Gomez":21, "Jude Law":41, "Scarlett Johansson":29, "Nicolas Cage":50}
  When not using map literals like above, maps must be created with make (not new) before use. The nil map is empty and cannot be assigned to.
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    type Vertex struct {
            Lat, Long float64
    }

    // nil map
    var m1 map[string]Vertex

    // map literal
    var m2 = map[string]Vertex{
            "Bell Labs": {40.68433, -74.39967},
            // same as "Bell Labs": Vertex{40.68433, -74.39967}
            "Google": {37.42202, -122.08408},
    }


    func main() {
            m1 = make(map[string]Vertex)
            m1["Bell Labs"] = Vertex{40.68433, -74.39967}
            fmt.Println(m1["Bell Labs"])
            // print map literal
            fmt.Println(m2)
    }
  #+END_SRC

  #+RESULTS:
  : {40.68433 -74.39967}
  : map[Bell Labs:{40.68433 -74.39967} Google:{37.42202 -122.08408}]

** Insert an element
   #+BEGIN_SRC go :results none :exports code
     m[key] = value
   #+END_SRC

** Delete an element
   #+BEGIN_SRC go :results none :exports code
     delete(m, key)
   #+END_SRC

** Retrieve an element
   If key is in m, ok is true. If not, ok is false and elem is the zero value for the map’s element type. Similarly, when reading from a map if the key is not present the result is the zero value for the map’s element type.
   #+BEGIN_SRC go :results none :exports code
     value, ok = m[key]
     // ok is true if key in m, value is zero otherwise
     value = m[key]
     // value is zero unless key in m
   #+END_SRC
