go_collection_types.html

<div id="outline-container-org578ee4c" class="outline-3">
<h3 id="org578ee4c"><span class="section-number-3">2.17</span> Push</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">
<pre class="src src-go">a = <span style="color: #b0c4de; font-weight: bold;">append</span>(a, x)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6af3430" class="outline-3">
<h3 id="org6af3430"><span class="section-number-3">2.18</span> Push Front</h3>
<div class="outline-text-3" id="text-2-18">
<div class="org-src-container">
<pre class="src src-go">a = <span style="color: #b0c4de; font-weight: bold;">append</span>([]<span style="color: #00ffff;">T</span>{x}, a...)
</pre>
</div>
</div>
</div>

<div id="outline-container-org19bb88a" class="outline-3">
<h3 id="org19bb88a"><span class="section-number-3">2.19</span> Shift</h3>
<div class="outline-text-3" id="text-2-19">
<div class="org-src-container">
<pre class="src src-go">x, a := a[0], a[1:]
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ae62bb" class="outline-3">
<h3 id="org2ae62bb"><span class="section-number-3">2.20</span> Reversing</h3>
<div class="outline-text-3" id="text-2-20">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">for</span> i := <span style="color: #b0c4de; font-weight: bold;">len</span>(a)/2-1; i &gt;= 0; i-- {
        opp := <span style="color: #b0c4de; font-weight: bold;">len</span>(a)-1-i
        a[i], a[opp] = a[opp], a[i]
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org90b4cbe" class="outline-2">
<h2 id="org90b4cbe"><span class="section-number-2">3</span> Range</h2>
<div class="outline-text-2" id="text-3">
<p>
The <b>range</b> form of the loop iterates over a <b>slice</b> or a <b>map</b>.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">var</span> pow = []<span style="color: #00ffff;">int</span>{1, 2, 4, 8, 16, 32, 64, 128}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #00ff00; font-weight: bold;">for</span> i, v := <span style="color: #00ff00; font-weight: bold;">range</span> pow {
                fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"2**%d = %d\n"</span>, i, v)
        }
}
</pre>
</div>

<pre class="example">
2**0 = 1
2**1 = 2
2**2 = 4
2**3 = 8
2**4 = 16
2**5 = 32
2**6 = 64
2**7 = 128

</pre>
<p>
You can skip <i>index</i> or <i>value</i> by assigning to _. If you only want the index, drop the ", value" entirely.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        pow := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">int</span>, 10)
        <span style="color: #00ff00; font-weight: bold;">for</span> i := <span style="color: #00ff00; font-weight: bold;">range</span> pow {
                pow[i] = 1 &lt;&lt; <span style="color: #00ffff; font-weight: bold;">uint</span>(i)
        }
        <span style="color: #00ff00; font-weight: bold;">for</span> _, value := <span style="color: #00ff00; font-weight: bold;">range</span> pow {
                fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%d\n"</span>, value)
        }
}
</pre>
</div>

<pre class="example">
1
2
4
8
16
32
64
128
256
512
</pre>
</div>

<div id="outline-container-org910b0ce" class="outline-3">
<h3 id="org910b0ce"><span class="section-number-3">3.1</span> Break &amp; continue</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        pow := <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">int</span>, 10)
        <span style="color: #00ff00; font-weight: bold;">for</span> i := <span style="color: #00ff00; font-weight: bold;">range</span> pow {
                pow[i] = 1 &lt;&lt; <span style="color: #00ffff; font-weight: bold;">uint</span>(i)
                <span style="color: #00ff00; font-weight: bold;">if</span> pow[i] &gt;= 16 {
                        <span style="color: #00ff00; font-weight: bold;">break</span>
                }
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(pow)

        pow = <span style="color: #b0c4de; font-weight: bold;">make</span>([]<span style="color: #00ffff;">int</span>, 10)
        <span style="color: #00ff00; font-weight: bold;">for</span> i := <span style="color: #00ff00; font-weight: bold;">range</span> pow {
                <span style="color: #00ff00; font-weight: bold;">if</span> i%2 == 0 {
                        <span style="color: #00ff00; font-weight: bold;">continue</span>
                }
                pow[i] = 1 &lt;&lt; <span style="color: #00ffff; font-weight: bold;">uint</span>(i)
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(pow)
}
</pre>
</div>

<pre class="example">
[1 2 4 8 16 0 0 0 0 0]
[0 2 0 8 0 32 0 128 0 512]

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2918e0" class="outline-2">
<h2 id="orgf2918e0"><span class="section-number-2">4</span> Maps</h2>
<div class="outline-text-2" id="text-4">
<p>
Maps are somewhat similar to what other languages call “dictionaries” or “hashes”. A map maps keys to values.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        celebs := <span style="color: #00ff00; font-weight: bold;">map</span>[<span style="color: #00ffff;">string</span>]<span style="color: #00ffff;">int</span>{
                <span style="color: #ffa500;">"Nicolas Cage"</span>:       50,
                <span style="color: #ffa500;">"Selena Gomez"</span>:       21,
                <span style="color: #ffa500;">"Jude Law"</span>:           41,
                <span style="color: #ffa500;">"Scarlett Johansson"</span>: 29,
        }

        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%#v"</span>, celebs)
}
</pre>
</div>

<pre class="example">
map[string]int{"Nicolas Cage":50, "Selena Gomez":21, "Jude Law":41, "Scarlett Johansson":29}

</pre>
<p>
When not using map literals like above, maps must be created with make (not new) before use. The nil map is empty and cannot be assigned to.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Vertex</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Lat, Long float64
}

<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">nil map</span>
<span style="color: #00ff00; font-weight: bold;">var</span> m1 <span style="color: #00ff00; font-weight: bold;">map</span>[<span style="color: #00ffff;">string</span>]<span style="color: #00ffff;">Vertex</span>

<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">map literal</span>
<span style="color: #00ff00; font-weight: bold;">var</span> m2 = <span style="color: #00ff00; font-weight: bold;">map</span>[<span style="color: #00ffff;">string</span>]<span style="color: #00ffff;">Vertex</span>{
        <span style="color: #ffa500;">"Bell Labs"</span>: {40.68433, -74.39967},
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">same as "Bell Labs": Vertex{40.68433, -74.39967}</span>
        <span style="color: #ffa500;">"Google"</span>: {37.42202, -122.08408},
}


<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        m1 = <span style="color: #b0c4de; font-weight: bold;">make</span>(<span style="color: #00ff00; font-weight: bold;">map</span>[<span style="color: #00ffff;">string</span>]<span style="color: #00ffff;">Vertex</span>)
        m1[<span style="color: #ffa500;">"Bell Labs"</span>] = <span style="color: #00ffff;">Vertex</span>{40.68433, -74.39967}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(m1[<span style="color: #ffa500;">"Bell Labs"</span>])
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">print map literal</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(m2)
}
</pre>
</div>

<pre class="example">
{40.68433 -74.39967}
map[Bell Labs:{40.68433 -74.39967} Google:{37.42202 -122.08408}]

</pre>
</div>

<div id="outline-container-orgc5890b5" class="outline-3">
<h3 id="orgc5890b5"><span class="section-number-3">4.1</span> Insert an element</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-go">m[key] = value
</pre>
</div>
</div>
</div>

<div id="outline-container-org343e6cf" class="outline-3">
<h3 id="org343e6cf"><span class="section-number-3">4.2</span> Delete an element</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #b0c4de; font-weight: bold;">delete</span>(m, key)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b3437a" class="outline-3">
<h3 id="org1b3437a"><span class="section-number-3">4.3</span> Retrieve an element</h3>
<div class="outline-text-3" id="text-4-3">
<p>
If key is in m, ok is true. If not, ok is false and elem is the zero value for the map’s element type. Similarly, when reading from a map if the key is not present the result is the zero value for the map’s element type.
</p>
<div class="org-src-container">
<pre class="src src-go">value, ok = m[key]
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">ok is true if key in m, value is zero otherwise</span>
value = m[key]
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">value is zero unless key in m</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-26 Thu 20:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
